cristianoag/esp32_clones/software/esp32_msx_emulator/lib/fmsx/EMULib/FDIDisk.c
/** EMULib Emulation Library *********************************/
/**                                                         **/
/**                        FDIDisk.c                        **/
/**                                                         **/
/** This file contains routines to load, save, and access   **/
/** disk images in various formats. The internal format is  **/
/** always .FDI. See FDIDisk.h for declarations.            **/
/**                                                         **/
/** Copyright (C) Marat Fayzullin 2007-2021                 **/
/**     You are not allowed to distribute this software     **/
/**     commercially. Please, notify me, if you make any    **/
/**     changes to this file.                               **/
/*************************************************************/
#include "FDIDisk.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <unistd.h>
#include <ctype.h>
#include <errno.h>
#include <sys/stat.h>
#ifdef _WIN32
#include <io.h>
#define fsync _commit
#endif
#include "../Esp32Port.h"
#ifdef ESP_PLATFORM
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#endif

#ifdef FMSX_TEST_MEDIA_IO
extern size_t fmsxTestDiskWrite(const void *,size_t,size_t,FILE *);
extern int fmsxTestDiskFlush(FILE *);
extern int fmsxTestDiskSync(int);
#define DISK_WRITE fmsxTestDiskWrite
#define DISK_FLUSH fmsxTestDiskFlush
#define DISK_SYNC fmsxTestDiskSync
#else
#define DISK_WRITE fwrite
#define DISK_FLUSH fflush
#define DISK_SYNC fsync
#endif

#ifdef ZLIB
#include <zlib.h>
#endif

#define IMAGE_SIZE(Fmt) \
  (Formats[Fmt].Sides*Formats[Fmt].Tracks*    \
   Formats[Fmt].Sectors*Formats[Fmt].SecSize)

#define FDI_SIDES(P)      ((P)[6]+((int)((P)[7])<<8))
#define FDI_TRACKS(P)     ((P)[4]+((int)((P)[5])<<8))
#define FDI_DIR(P)        ((P)+(P)[12]+((int)((P)[13])<<8)+14)
#define FDI_DATA(P)       ((P)+(P)[10]+((int)((P)[11])<<8))
#define FDI_INFO(P)       ((P)+(P)[8]+((int)((P)[9])<<8))
#define FDI_SECTORS(T)    ((T)[6])
#define FDI_TRACK(P,T)    (FDI_DATA(P)+(T)[0]+((int)((T)[1])<<8)+((int)((T)[2])<<16)+((int)((T)[3])<<24))
#define FDI_SECSIZE(S)    (SecSizes[(S)[3]<=4? (S)[3]:4])
#define FDI_SECTOR(P,T,S) (FDI_TRACK(P,T)+(S)[5]+((int)((S)[6])<<8))

static const struct { int Sides,Tracks,Sectors,SecSize; } Formats[] =
{
  { 2,80,16,256 }, /* Dummy format */
  { 2,80,10,512 }, /* FMT_IMG can be 256 */
  { 2,80,10,512 }, /* FMT_MGT can be 256 */
  { 2,80,16,256 }, /* FMT_TRD    - ZX Spectrum TRDOS disk */
  { 2,80,10,512 }, /* FMT_FDI    - Generic FDI image */
  { 2,80,16,256 }, /* FMT_SCL    - ZX Spectrum TRDOS disk */
  { 2,80,16,256 }, /* FMT_HOBETA - ZX Spectrum HoBeta disk */
  { 2,80,9,512 },  /* FMT_MSXDSK - MSX disk */
  { 2,80,9,512 },  /* FMT_CPCDSK - CPC disk */
  { 1,40,16,256 }, /* FMT_SF7000 - Sega SF-7000 disk */
  { 2,80,10,512 }, /* FMT_SAMDSK - Sam Coupe disk */
  { 1,40,8,512 },  /* FMT_ADMDSK - Coleco Adam disk */
  { 1,32,16,512 }, /* FMT_DDP    - Coleco Adam tape */
  { 2,80,10,512 }, /* FMT_SAD    - Sam Coupe disk */
  { 2,80,9,512 }   /* FMT_DSK    - Assuming 720kB MSX format */
};

static const int SecSizes[] =
{ 128,256,512,1024,4096,0 };

static const char FDIDiskLabel[] =
"Disk image created by EMULib (C)Marat Fayzullin";

static const byte TRDDiskInfo[] =
{
  0x01,0x16,0x00,0xF0,0x09,0x10,0x00,0x00,
  0x20,0x20,0x20,0x20,0x20,0x20,0x20,0x20,
  0x20,0x00,0x00,0x64,0x69,0x73,0x6B,0x6E,
  0x61,0x6D,0x65,0x00,0x00,0x00,0x46,0x55
};

static int stricmpn(const char *S1,const char *S2,int Limit)
{
  for(;*S1&&*S2&&Limit&&(toupper(*S1)==toupper(*S2));++S1,++S2,--Limit);
  return(Limit? toupper(*S1)-toupper(*S2):0);
}

/** InitFDI() ************************************************/
/** Clear all data structure fields.                        **/
/*************************************************************/
void InitFDI(FDIDisk *D)
{
  D->Format   = 0;
  D->Data     = 0;
  D->DataSize = 0;
  D->Sides    = 0;
  D->Tracks   = 0;
  D->Sectors  = 0;
  D->SecSize  = 0;
  D->BackingFile = 0;
  D->BackingSize = 0;
  D->BackingPath[0] = 0;
  D->WriteFault = 0;
}

/** EjectFDI() ***********************************************/
/** Eject disk image. Free all allocated memory.            **/
/*************************************************************/
void EjectFDI(FDIDisk *D)
{
  if(D->BackingFile&&fclose(D->BackingFile))
    printf("MSX disk: close failed for %s (errno %d)\n",D->BackingPath,errno);
  if(D->Data) free(D->Data);
  InitFDI(D);
}

int WriteFDI(FDIDisk *D,byte *Sector,const byte *Buf)
{
  long Offset;
  struct stat Info;
  if(!D||!D->Data||!Sector||!Buf) { errno=EINVAL;return(0); }
  if(D->Data[3]) { errno=EROFS;return(0); }
  if(D->WriteFault) { errno=EIO;return(0); }
  if(D->BackingFile)
  {
    Offset=Sector-DataFDI(D);
    if(D->SecSize!=512||Offset<0||Offset%512||Offset+512>D->BackingSize)
    { errno=EINVAL;return(0); }
    /* Detect removal/truncation before touching the file; never grow an image. */
    if(fstat(fileno(D->BackingFile),&Info)||Info.st_size!=D->BackingSize||
       fseek(D->BackingFile,Offset,SEEK_SET)||
       DISK_WRITE(Buf,1,512,D->BackingFile)!=512||
       DISK_FLUSH(D->BackingFile)||DISK_SYNC(fileno(D->BackingFile)))
    {
      printf("MSX disk: write failed for %s at sector %ld; reattach disk (errno %d)\n",
             D->BackingPath,Offset/512,errno);
      D->WriteFault=1;
      errno=EIO;
      return(0);
    }
#ifdef ESP_PLATFORM
    /* Long BIOS multi-sector writes must still service the idle watchdog. */
    {
      static TickType_t LastYield;
      TickType_t Now=xTaskGetTickCount();
      if(Now-LastYield>=pdMS_TO_TICKS(20))
      { vTaskDelay(1);LastYield=xTaskGetTickCount(); }
    }
#endif
  }
  memcpy(Sector,Buf,D->SecSize);
  return(1);
}

/** NewFDI() *************************************************/
/** Allocate memory and create new .FDI disk image of given **/
/** dimensions. Returns disk data pointer on success, 0 on  **/
/** failure.                                                **/
/*************************************************************/
byte *NewFDI(FDIDisk *D,int Sides,int Tracks,int Sectors,int SecSize)
{
  byte *P,*DDir;
  int I,J,K,L,N;

  /* Find sector size code */
  for(L=0;SecSizes[L]&&(SecSizes[L]!=SecSize);++L);
  if(!SecSizes[L]) return(0);

  /* Allocate memory */
  K = Sides*Tracks*Sectors*SecSize+sizeof(FDIDiskLabel);
  I = Sides*Tracks*(Sectors+1)*7+14;
  if(!(P=(byte *)fmsxAllocate(I+K))) return(0);
  memset(P,0x00,I+K);

